УТ_для_edt/src/Catalogs/CRM_ВидыВзаимодействий/CRM_ВидыВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВидыВзаимодействий</name>
  <comment>АПК:1034 не проверять на орфографию справку</comment>
  <predefined>
    <items>
      <name>Встреча</name>
      <description>Встреча</description>
    </items>
    <items>
      <name>ВыезднаяВстречаИнтерес</name>
      <description>Выездная встреча интерес</description>
    </items>
    <items>
      <name>ВыезднаяВстречаПартнер</name>
      <description>Выездная встреча партнер</description>
    </items>
    <items>
      <name>ЛичнаяЗадача</name>
      <description>Задача</description>
    </items>
    <items>
      <name>ОбзвонКлиентов</name>
      <description>Обзвон клиентов</description>
    </items>
    <items>
      <name>ПотеряОбращения</name>
      <description>Потеря обращения</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.CRM_ВходящееИсходящееСобытие</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьАвтоматическиПриПереходеВСосотояние</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйСрокДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьВЖурналеВстреч</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьВстречиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекЛиста</name>
    <type>
      <types>CatalogRef.CRM_ШаблоныЧекЛистаВзаимодействий</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ВидыДелВзаимодействий/CRM_ВидыДелВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВидыДелВзаимодействий</name>
  <predefined>
    <items>
      <name>Задача_ЗадачаИсполнителя</name>
      <description>Задача</description>
    </items>
    <items>
      <name>Документ_CRM_Интерес</name>
      <description>Интерес клиента</description>
    </items>
    <items>
      <name>ПрочиеДокументы</name>
      <description>Прочее</description>
    </items>
  </predefined>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ВидыВзаимодействий/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначенияЗаполнения") 
		И (ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")) 
		И Параметры.ЗначенияЗаполнения.Свойство("ВидДела") Тогда
		Объект.ВидДела = Параметры.ЗначенияЗаполнения.ВидДела;
	КонецЕсли;
	ВидДелаИнтерес = (Объект.ВидДела = ПредопределенноеЗначение("Справочник.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес"));
	Элементы.СостояниеИнтереса.Доступность = ВидДелаИнтерес;
	Элементы.ПланироватьАвтоматическиПриПереходеВСосотояние.Видимость = ВидДелаИнтерес;
	Элементы.ГруппаСрок.Видимость = ВидДелаИнтерес;
	Элементы.ПланироватьАвтоматическиПриПереходеВСосотояние.Видимость = ЗначениеЗаполнено(Объект.СостояниеИнтереса);
	Элементы.ГруппаПланированиеВстреч.Доступность = (Объект.ВидДела = Справочники.CRM_ВидыДелВзаимодействий.ПрочиеДокументы);
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ВидДелаПриИзменении(Элемент)
	Элементы.СостояниеИнтереса.Доступность = Объект.ВидДела = ПредопределенноеЗначение("Справочник.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес");
	Элементы.ГруппаПланированиеВстреч.Доступность =  (Объект.ВидДела = ПредопределенноеЗначение("Справочник.CRM_ВидыДелВзаимодействий.ПрочиеДокументы"));
КонецПроцедуры

&НаКлиенте
Процедура СостояниеИнтересаПриИзменении(Элемент)
	Элементы.ПланироватьАвтоматическиПриПереходеВСосотояние.Видимость = ЗначениеЗаполнено(Объект.СостояниеИнтереса);
КонецПроцедуры

&НаСервере
Процедура ВидСобытияПриИзмененииНаСервере()
	//Если Объект.ВидСобытия = Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча Тогда
	//	Элементы.ГруппаПланированиеВстреч.Видимость = Истина;
	//Иначе	
	//	Элементы.ГруппаПланированиеВстреч.Видимость = Ложь;
	//	Объект.ДлительностьВстречиПоУмолчанию = 0;
	//	Объект.ПланироватьвЖурналеВстреч = Ложь;
	//КонецЕсли	
КонецПроцедуры

&НаКлиенте
Процедура ВидСобытияПриИзменении(Элемент)
	ВидСобытияПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти
